Autodesk.Revit.DB.ForgeSchemaClosure.#ctor(System.String,System.Collections.Generic.IDictionary{System.String,System.String},System.Collections.Generic.IList{System.String},System.String,System.Boolean,System.Boolean)
Constructs a ForgeTypeId holding the given schema identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null